/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   parsing.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: tikhacha <tikhacha@student.42.fr>          +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/07/07 20:19:29 by tikhacha          #+#    #+#             */
/*   Updated: 2023/07/14 00:41:31 by tikhacha         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "minishell.h"

void	parser(t_list env, t_init *init);

void	parser(t_list env, t_init *init)
{
	(void)	init;
	(void)	env;
	init->pars = NULL;
}















//եթե տեսնում ա && ավտոմատ ձախ ու աջ ա կիսում
//եթե տեսնում ա () ավտոմատ սպասում ա աջինին
//ու վերջնական արժեք պահում, դարձնելով միջինը
//ընդհանուր մի մաս։ Այսինքն իրանից են գնում իրա
//միջի ճյուղավորումները
//այսինքն աջն ու ձախը կլինեն իրա մաս կազմող հրամանի աջն ու ձախը, բայց իրանից ներքև իջնենք մի հատ նոր

//	(ls -l && (ls || pwd)) && (cat script.sh || ls)
//	( && ( || )) && ( || )
//				 ||
//				[&&]
//		 ---------------
//		 ||			  ||
//	(          )    (    )
//	     ||           ||
//	   ------  		 [||]
//   [&&]   ||
//		  (    )
//		   [&&]
/*

այսինքն կարա պրոստը նայի ման գա եթե փակագիծ կա, նախ փակագիծը կառուցի
ոնց ա կառուցելու -» նոր լիստ, որտեղ առաջի տարը կլինի պարենթեզիս
տարրը իրա մեջ կունենա երկրորդ ստրուկտուրա վալուե ու մեջը կպահի փակագծերի մեջ եղածը

հետո ման կգա էլի թազա փակագծեր ճարի, եթե չճարի, ուրեմն ման կգա և

և-ից աջ ու ձախ ընկածները վեկալենք օբշի մի հատ և ստրուկտուրայի մեջ, որ իրա մեջ առանձին կպահի ձախ ու աջ կողմերը
եթե իրանից ձախ կամ աջ փակագխեր կային, նախորդ ստրուկտուրան փակագծերի քցել ևի մեջ
ու տենց շարունակ

left-ով թող արդեն ստեղծածը քցի ուրիշի մեջ, իսկ ռայթով թող քցի իրա մեջ ուրիշին

ասենք


(ls -l || pwd) && cat script.sh | grep echo | wc && ls

ls -l գնաց
հանդիպեց || ու ավելացրեց իրանից ձախ
||	ls -l
գնաց ու հանդիպեց pwd, ավելացրեց իրանից աջ
|| ls -l pwd

ստացանք նման մի բան
cmd:
	||:
		ls -l
		pwd

գնացինք առաջ ու տեսանք փակվող փակագիծը, եղածն ավելացրինք նորի մեջ ձախից, փակագծի
cmd:
	():
		||: (prev, next -> null)
			ls -l (prev null, next -> pwd)
			pwd (prev -> ls -l, next -> null)

գնացինք առաջ ու տեսանք և, ավելացրեցինք ձախից

cmd:
	&&:
		():
			():
				ls -l
				pwd

և-ի աջ կողմը տեսանք cat script.sh, ավելացրինք նեքսթով

cmd:
	&&:
		():
			():
				ls -l
				pwd
		cat script.sh

գնացինք առաջ pipe տեսանք, ավելացրեցինք ձախից

cmd:
	&&:
		():
			():
				ls -l
				pwd
		|:
			cat script.sh

ու տենց մինչև հասանց wc

cmd:
	&&:
		():
			():
				ls -l
				pwd
		|:
			cat script.sh
			grep echo
			wc

*/